-- MySQL dump 10.13  Distrib 8.0.29, for Win64 (x86_64)
--
-- Host: localhost    Database: library
-- ------------------------------------------------------
-- Server version	8.0.29

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `book`
--

DROP TABLE IF EXISTS `book`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `book` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(120) NOT NULL,
  `description` text,
  `dateOfPublish` date NOT NULL DEFAULT '2018-01-01',
  `kategories` varchar(30) NOT NULL,
  `isbn` varchar(30) NOT NULL,
  `pages` int NOT NULL,
  `authorFirstName` varchar(45) NOT NULL,
  `authorSecondName` varchar(45) NOT NULL,
  `email` varchar(50) NOT NULL,
  `age` int NOT NULL,
  `birthDay` date NOT NULL,
  `awards` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `Book_un` (`isbn`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book`
--

LOCK TABLES `book` WRITE;
/*!40000 ALTER TABLE `book` DISABLE KEYS */;
INSERT INTO `book` VALUES (1,' Дневник. 1917-1921. Письма ','','2001-01-01','Історія','5-265-03471-4',544,'Владимир ','Короленко ','korolenko@gmail.com',68,'1853-07-25',' присвоєно звання «Праведник України» '),(2,' Крымское наследие ',' К 150-летию со дня рождения академика В. И. Вернадского ','2012-01-01','Наука ','978-966-06-0631-9',272,'Владимир ',' Вернадский ','vernatskiy@gmail.com',82,'1863-02-28',' Лауреат Сталинской премии I степени (1943). '),(3,' Биосфера и ноосфера ','','2004-01-01','Наука ','5-8112-0320-9',576,'Владимир ',' Вернадский ','vernatskiy@gmail.com',82,'1863-02-28',' Лауреат Сталинской премии I степени (1943). '),(5,'Німецькі поселенці на українських землях: історичні та актуальні проблеми і перспективи','За результатами Міжнародної науково-практичної конференції, 16-17 трав. 2013 року : до 210-річниці появи перших німецьких поселенців у Полтаві / Полтавський ун-т економіки і торгівлі, Центр німецької мови і культури, Головне управління інформаційної та внутрішньої політики Полтавської облдержадміністрації, Магдебурзькийун-т ім. Отто фон Геррике, Ін-т мов м. Кассель. - Полтава : Полтавський літерат','2013-01-01','Історія','978-966-192-071-1',240,' Валентин ','Посухов ','posuchiy@gmail.com ',52,'1970-01-01',''),(6,' Полтавщина в одинадцятій п’ятирічці ',' Від рубежу до рубежу ','1981-01-01','Краєзнавство ','978-966-12-007-0',95,' Василь ','Барабаш','barabash@gmail.com ',65,'1958-02-03',''),(7,' В. І. Вернадський і Полтавщина ',': факти, документи, бібліографія / уклад ','2008-01-01','Краєзнавство ','978-966-192-007-0 ',260,'Володимир','Самородов','samorodov@gmail.com',45,'1977-08-03','Премія ім.. Короленка 1996 р.'),(8,'Гостинна Полтавщина','Короткий путівник-довідник','2007-01-01','Краєзнавство ','5-81234-0320-9',58,'Петро ','Годзенко','godzenko@ukr.net',38,'1984-07-15',''),(9,' Земля - берегиня: Полтавщиною - підземними ходами ',' В книзі з номером 1044348 - дарчий надпис автора ','2007-01-01','Історія','978-966-8350-31-3 ',79,' Валентин ',' Посухов ','posuhov@ukr.net',50,'1973-02-02',''),(10,' Полтавщина: Лохвицький край ',' Назва обкл. : Лохвицький край ','2004-01-01','Краєзнавство ','966-8285-13-1 ',108,'Олександр ',' Панченко ','panchenko@ukr.net ',62,'1960-03-05','Герой Полтавщини'),(11,' Полтавська Петлюріана ',' Ч. 1 : Матеріали II Петлюрівських читань, проведених у Полтаві 15 серпня 1993 ','1996-01-01','Історія','966-8223485-13-1 ',92,'Микола','Кульчинський','kulsdfd@in.ua',70,'1954-03-06',''),(12,' Вогненна квітка ',' Леся  Українка і Полтавщина: деякі аспекти життя і творчості ','2001-01-01','Література','966-7462-52-8 ',214,'Григорій','Шанько','sganko@ukr.net',28,'1994-02-05','Відзнака президента України 2020 р.'),(13,' Полтавщина в роки другої світової війни (1939-1945)  ',' В книзі дарчий надпис автора ','2004-01-01','Історія','966-96206-4-8',288,'Віктор','Ревегук','Reve67@meta.ua',67,'1955-04-06','Почесна грамота Обласної ради'),(14,' Полтавщину славлю піснями ',' збірка пісень та ноти ','2005-01-01','Культура','966-8350-06-5 ',98,'Михайло ','Савченко','Savchenko5634@meta.ua ',32,'1990-04-08',''),(15,' Євреї і Полтавщина ',' : історія... Імена... Долі  Б-ка товариства \"Єврейська спадщина ','2005-01-01','Краєзнавство ','966-8250-11-7',100,'Анатолій','Мучник','muchikAnatol@meta.ua ',48,'1974-06-04',''),(17,' Генеральний конструктор АК-47 і Полтавщина ',' документальний збірник ','2005-01-01','Краєзнавство ','966-825750-11-7',58,'Петро ','Михайлик','petro@gmail.com',30,'1992-04-06',''),(18,' Полтавщину славлю піснями 2 ',' Збірка пісень та ноти частина 2 ','2005-01-01','Культура','966-833450-06-5 ',98,'Михайло ','Савченко','Savchenko5634@meta.ua ',32,'1990-04-08','');
/*!40000 ALTER TABLE `book` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-07-25 16:52:25
